[
  {
    "path": "posts/2020-12-08-linking-maternal-and-newborn-records/",
    "title": "Linking Maternal and Newborn Records in 2018 Nutrition Surveys",
    "description": "How to build a rowwise function linking children to mothers in the 2018 Nutrition Surveys for Burkina Faso and Kenya.",
    "author": [
      {
        "name": "Matt Gunther",
        "url": {}
      }
    ],
    "date": "2020-12-08",
    "categories": [],
    "contents": "\n\nContents\nSetup\nLinking by household and birthdateHow does it work?\nResults\n\nSearching for Additional CasesAdditional Results\n\nAnalysis\n\n\npreserve75e99b46e46448c2\n\nThe PMA 2018 nutrition survey module for Burkina Faso and Kenya contains hundreds of indicators measuring diet and nutritional status for women aged 10-49 and children under age 5. In some households, the 2018 survey design included both children and their biological mother, but their relationships are not immediately available in the data.\nThis post shows how to write an R function that will link child and maternal records, provided that both mother and child were surveyed. These links may be particularly useful for researchers studying the effectiveness of different antenatal interventions on early childhood nutrition. For example, (insert analysis plan here).\nSetup\nTo run the code in this post, you’ll need the tidyverse package from CRAN. See our post Installing and Loading Useful R Packages for help.\n\n\nlibrary(tidyverse)\n\n\n\nTo keep things simple, we’ll focus on 2018 Nutrition data from Burkina Faso, which you can download at pma.ipums.org. See our post Downloading an IPUMS Extract for R for help.\n\n\n# Data import and object assignment goes here\n\n\n\nLinking by household and birthdate\nThe easiest way to match mothers and children is to look within each household for a child whose date of birth KIDBIRTHYR and KIDBIRTHMO matches the birth record data for any women living in that same household. The 2018 Nutrition survey only contains dates for each woman’s most recent birth in LASTBIRTHYR and LASBIRTHMO, so we can only match a mother to her most recent child.\nWhile this approach won’t match every mother and child, we can safely assume that we’ve found a correct pair in each household if we also make sure that the birthdates allow for only one possible match. For example, if two women in the same household last gave birth in the same month and year, we should make sure to exclude them (since we wouldn’t be able to tell which mother matches which child).\n\n\nbf2018a_nh <- bf2018a_nh %>% \n  group_by(HHID) %>% \n  mutate(MOMID = case_when(ELIGTYPE < 20 ~ pmap_chr(\n    cur_data() %>%\n      select(KIDBIRTHYR,\n             KIDBIRTHMO,\n             LASTBIRTHYR,\n             LASTBIRTHMO), \n    function(...){\n      kid <- tibble(...)\n      sameYr <- which(LASTBIRTHYR == kid$KIDBIRTHYR)\n      sameMo <- which(LASTBIRTHMO == kid$KIDBIRTHMO)\n      mom <- intersect(sameYr, sameMo)\n      if(length(mom)==1){return(PERSONID[mom])}else{return(NA)}\n    }\n  ))) %>% \n  ungroup()\n\n\n\nHow does it work?\nWe create a variable MOMID that stores the unique person identifier PERSONID for each child’s mother.\nTo find each child’s mother, we restrict our search to individuals living in the same household (group_by(HHID)). Then, we assign MOMID only to child records by selecting cases where ELIGTYPE < 20.\nThen, for each child in the household, we use the pmap_chr() function to examine each of the records for individuals who live with the child. For sake of speed, we pass only the variables KIDBIRTHYR, KIDBIRTHMO, LASTBIRTHYR, and LASTBIRTHMO to the anonymous function inside pmap_chr.\nFinally, kid <- tibble(...) stores a temporary one-row data frame containing information on the child, which we can then reference with kid$BIRTHYR and kid$BIRTHMO. As pmap_chr iterates through each household member, it assigns mom to any person who gave birth on the child’s birthday. If only one person fits, that person’s PERSONID becomes the child’s MOMID.\nResults\nIn total, 796 children were linked to a mother: this is only about 28% of the 2856 children listed by the grouping variable ELIGTYPE:\n\n\nbf2018a_nh %>% count(ELIGTYPE, HASMOMID = !is.na(MOMID))\n\n\n# A tibble: 9 x 3\n                                               ELIGTYPE HASMOMID     n\n                                              <dbl+lbl> <lgl>    <int>\n1 11 [Infant under age 2 (INF)]                         FALSE      731\n2 11 [Infant under age 2 (INF)]                         TRUE       463\n3 14 [Aged 2-5 (K)]                                     FALSE     1329\n4 14 [Aged 2-5 (K)]                                     TRUE       333\n5 20 [Selected women aged 10-49 (WN)]                   FALSE     2411\n6 31 [Member of household included in nutrition sample] FALSE     9045\n7 32 [Member of household excluded from nutrition samp… FALSE     3535\n8 95 [Not interviewed (female questionnaire)]           FALSE       51\n9 96 [Not interviewed (household questionnaire)]        FALSE      101\n\nWhy were so few children matched successfully? Part of the answer has to do with the nutrition sample design: in Burkina Faso, women aged 10-49 were included from just 45% of households selected at random from the household screening sample (in the Kenya 2018 sample, 25% of households were randomly selected). As a result, we might estimate that only around 45% of children could possibly be linked to mother included in the nutrition sample:\n\n\nbf2018a_nh %>%\n  mutate(MOMS_IN_HH = case_when(ELIGTYPE < 20 ~ pmap_chr(\n    cur_data() %>%\n      select(HHID, ELIGTYPE), \n    function(...){\n      kid <- tibble(...)\n      sameHH <- which(HHID == kid$HHID & ELIGTYPE == 20)\n      if(length(sameHH)>0){return(\"yes\")}else{return(\"no\")}\n    }\n  ))) %>%\n  group_by(ELIGTYPE, MOMS_IN_HH) %>%\n  count()\n\n\n# A tibble: 9 x 3\n# Groups:   ELIGTYPE, MOMS_IN_HH [9]\n                                             ELIGTYPE MOMS_IN_HH     n\n                                            <dbl+lbl> <chr>      <int>\n1 11 [Infant under age 2 (INF)]                       no           655\n2 11 [Infant under age 2 (INF)]                       yes          539\n3 14 [Aged 2-5 (K)]                                   no           924\n4 14 [Aged 2-5 (K)]                                   yes          738\n5 20 [Selected women aged 10-49 (WN)]                 <NA>        2411\n6 31 [Member of household included in nutrition samp… <NA>        9045\n7 32 [Member of household excluded from nutrition sa… <NA>        3535\n8 95 [Not interviewed (female questionnaire)]         <NA>          51\n9 96 [Not interviewed (household questionnaire)]      <NA>         101\n\nThis confirms our estimate: only 1277 of the 2856 sampled children live in a household with a woman aged 10-49 who was also included in the nutrition sample. In other words, 45% of sampled children live in a household with a sampled mother. Our search found matches for 28% of all children, but this reflects 62% of the children who live in a household with a sampled mother.\nFortunately, because households were randomly selected for the female nutrition sample, we should have no reason to suspect that the 796 children matched to mothers by our search criteria represent a biased sub-sample of the 2856 children overall. However, before proceeding with further analysis, it would be worthwhile to see if we can increase the number of linked children with additional search criteria.\nSearching for Additional Cases\nIn the example above, the use of LASTBIRTHMO and LASTBIRTHYR ensured that only mother’s most recent child could be linked to her record.\nIt’s possible to expand these criteria in certain circumstances using RELATEKID, which describes the relationship between each child and the person who provided responses to the interviewer on their behalf.\nWhen RELATEKID == 1, the respondent to the child’s questionnaire is the child’s mother. So, if RELATEKID == 1 and if only one woman in the child’s household has ever given birth, we could reasonably identify that person as the child’s mother.\n\n\nbf2018a_nh <- bf2018a_nh %>%\n  group_by(HHID) %>% \n  mutate(MOMID = case_when(\n    ELIGTYPE < 20 ~ pmap_chr(\n      cur_data() %>% \n        select(\n          KIDBIRTHYR,\n          KIDBIRTHMO,\n          LASTBIRTHYR,\n          LASTBIRTHMO,\n          RELATEKID\n        ), \n      function(...){\n        kid <- tibble(...)\n        sameYr <- which(LASTBIRTHYR == kid$KIDBIRTHYR)\n        sameMo <- which(LASTBIRTHMO == kid$KIDBIRTHMO)\n        mom <- intersect(sameYr, sameMo)\n        moms_in_hh <- which(LASTBIRTHYR < 9000)\n        if(length(mom) == 1){ \n          return(PERSONID[mom])\n        }else if(length(moms_in_hh) == 1 & kid$RELATEKID == 1){\n          return(PERSONID[moms_in_hh])\n        }else{\n          return(NA)\n        }\n      }\n    )\n  )) %>% \n  ungroup()\n\n\n\nThis is the same function as before, but with one major addition. We count all of the women in the child’s household who have ever given birth moms_in_hh. If our previous method doesn’t identify the child’s mother, we then look to see if there’s only one mother in the household length(moms_in_hh) == 1 and if the respondent for the child’s questionnaire was their mother kid$RELATEKID == 1.\nAdditional Results\nWith these expanded search criteria, 1079 children were matched to a mother’s record: an improvement by 283 cases!\n\n\nbf2018a_nh %>% count(ELIGTYPE, HASMOMID = !is.na(MOMID))\n\n\n# A tibble: 9 x 3\n                                               ELIGTYPE HASMOMID     n\n                                              <dbl+lbl> <lgl>    <int>\n1 11 [Infant under age 2 (INF)]                         FALSE      688\n2 11 [Infant under age 2 (INF)]                         TRUE       506\n3 14 [Aged 2-5 (K)]                                     FALSE     1089\n4 14 [Aged 2-5 (K)]                                     TRUE       573\n5 20 [Selected women aged 10-49 (WN)]                   FALSE     2411\n6 31 [Member of household included in nutrition sample] FALSE     9045\n7 32 [Member of household excluded from nutrition samp… FALSE     3535\n8 95 [Not interviewed (female questionnaire)]           FALSE       51\n9 96 [Not interviewed (household questionnaire)]        FALSE      101\n\nBecause only 1277 children in the nutrition sample live with a sampled mother, we have now established almost 85% of the possible links between mothers and children.\nHowever, these additional 283 cases should be used with some degree of caution: they represent children from smaller households compared to the remaining 15% ofchildren who, for the most part, live in households where more two or more mothers reside together. Further analysis should determine whether and how the selection of these smaller households might bias the social and economic composition of our sub-sample.\nAnalysis\nSuppose a researcher wanted to learn whether newborn feeding information given to mothers by health providers seems to have an impact on the nutrition and growth of young children.\nNow that we’ve linked as many children as possible to their mother’s records, we could create a variable MOMINFO indicating whether the mother ever received newborn feeding information from a health provider or community health worker during her most recent pregnancy.\nWe could then take each child’s mid-upper arm circumference (MUAC) KIDARMCIRCVAL as a simple proxy measure for growth and nutrition. Comparing children whose mothers received newborn feeding information to those whose mothers received none, no real difference seems to exist (at least not without additional control variables):\n\n\nbf2018a_nh %>%\n  filter(!is.na(MOMID)) %>%\n  rowwise() %>%\n  mutate(MOMINFO = bf2018a_nh$RPFEEDINFO[which(bf2018a_nh$PERSONID == MOMID)]) %>%\n  filter(MOMINFO %in% 0:1 & KIDARMCIRCVAL < 90) %>%\n  mutate(MOMINFO = as_factor(MOMINFO)) %>%\n  ggplot(aes(KIDARMCIRCVAL, color = MOMINFO, fill = MOMINFO)) +\n    geom_density(alpha = 0.2) +\n    scale_color_manual(values = c(\"#00263A\", \"#98579B\")) +\n    scale_fill_manual(values = c(\"#00263A\", \"#98579B\"))\n\n\n\n\nOr course, much more could be done to investigate the relationship between antenatal interventions and the growth of young children. Let us know what you uncover by linking mothers to children in the 2018 nutrition data!\n\n\n\n",
    "preview": "posts/2020-12-08-linking-maternal-and-newborn-records/linking-maternal-and-newborn-records_files/figure-html5/unnamed-chunk-8-1.png",
    "last_modified": "2020-12-08T17:14:05-06:00",
    "input_file": "linking-maternal-and-newborn-records.utf8.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to PMA Data Hub",
    "description": "Welcome to our new blog, PMA Data Hub. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Nora Jones",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2020-12-08",
    "categories": [],
    "contents": "\nh1\nh2\nh3\nh4\nh5\nh6\nnormal italics bold\n\n\n\n",
    "preview": {},
    "last_modified": "2020-12-08T11:04:31-06:00",
    "input_file": {}
  }
]
