[
  {
    "path": "posts/2021-01-15-mapping-sdp-variables/",
    "title": "Mapping Service Delivery Point Data",
    "description": "Map spatial variation in the service delivery environment across enumeration areas.",
    "author": [
      {
        "name": "Nina Brooks",
        "url": {}
      }
    ],
    "date": "2021-01-15",
    "categories": [
      "Individual in Context",
      "Serivce Delivery Points",
      "Mapping",
      "sf"
    ],
    "contents": "\n\nContents\nData\nSetup\nMerge and Map\nExploratory Maps\nMerge GPS and SDP Data\n\nMap SDP data\n\n\n\n Download this page as R code\n\n\nIn our last post, we showed how PMA Service Delivery Point (SDP) data can be aggregated to the enumeration area they serve (captured by EASERVED) and linked to the individual-level PMA survey data. In this post, we’ll show how the SDP data can be linked to the PMA GPS datasets. Then, we’ll map different variables to show how variation in variables can be understood spatially.\nData\nWe’ll be working with the final sdp dataset created in the previous post. You can either check out that post here or just load the sdp dataset from the “data” folder for this post in the PMA Data Hub repository on GitHub (add link). We’ll focus on a few of the EASEARVED-level variables created in the last post:\nNUM_METHODS_PROV - number of methods provided by at least one SDP\nNUM_METHODS_OUT - number of methods out of stock with at least one SDP\nNUM_METHODS_INSTOCK - number of methods in-stock with at least one SDP\nNUM_METHODS_OUT3MO - number of methods out of stock any time in the last 3 months with at least one SDP\nMEAN_OUTDAY - the mean length of a stockout for any family planning method (measured in days)\nN_SDP - number of SDPs\nWe’ll also use the STRATA variable, which identifies whether an EA is in an urban or rural area.\nWe’ll also be working with the PMA GPS datasets for Burkina Faso. The GPS data include one GPS coordinate per enumeration area. The Burkina Faso Round 5 and 6 surveys sampled the same enumeration areas, which means we can link the GPS data to both rounds (either mention here or in the aside later on).\n\nRead more about the GPS data and request access on the PMA on the PMA Data website.\nThe last dataset we’ll use in this post are the adminstrative boundaries for Burkina Faso. Shapefiles with administrative boundaries are widely available for download, but we’ll use the R package GADMTools, which allows you to download shapefiles directly in R.\nSetup\n\n\nlibrary(ipumsr)\nlibrary(sf) # primary spatial package\nlibrary(GADMTools) # for downloading shapefiles\nlibrary(viridis) # for color palettes\nlibrary(tidyverse)\n\n\n\nLoad the SDP data and the GPS data from the data folder and check out what the GPS data contains:\n\n\nload(\"data/sdp.Rdata\") \n\ngps <- read_csv(\"data/PMA_BF_GPS_v1_24Jul2018.csv\")\ngps\n\n\n# A tibble: 83 x 7\n   PMACC PMAYEAR REGION               EA_ID GPSLONG GPSLAT DATUM\n   <chr>   <dbl> <chr>                <dbl>   <dbl>  <dbl> <chr>\n 1 BF       2017 5. centre-nord        7610  -1.07    12.9 WGS84\n 2 BF       2017 1. boucle-du-mouhoun  7820  -4.07    12.7 WGS84\n 3 BF       2017 3. centre             7271  -1.58    12.4 WGS84\n 4 BF       2017 3. centre             7799  -1.54    12.4 WGS84\n 5 BF       2017 8. est                7243   0.380   12.1 WGS84\n 6 BF       2017 6. centre-ouest       7026  -2.37    12.3 WGS84\n 7 BF       2017 3. centre             7859  -1.57    12.3 WGS84\n 8 BF       2017 3. centre             7725  -1.55    12.3 WGS84\n 9 BF       2017 6. centre-ouest       7390  -2.21    12.1 WGS84\n10 BF       2017 11. plateau-central   7104  -1.91    12.8 WGS84\n# … with 73 more rows\n\nThe gps data has 7 variables:\nPMACC: the 3-letter country code (ask Devon about this - they seem to be 2-letters?)\nPMAYEAR: the 4-digit year of data collection\nREGION: sub-national administrative division name\nEA_ID: the enumeration area ID (and how we’ll merge this data into other PMA datasets)\nGPSLAT: the displaced EA’s centroid latitude coordinate in decimal degrees\nGPSLONG: the displaced EA’s centroid longitude coordinate in decimal degrees\nDATUM: the coordinate reference system and geographic datum. This variable is always “WGS84” for the World Geodetic System 1984.\n\nNote that while the PMAYEAR variable is 2017 for all EAs, because the same EAs were sampled in the 2017 (Round 5) and 2018 (Round 6) surveys, we can link these coordinates to both samples.\n\nThe REGION variable corresponds to the first administrative level in a given country or adm_1 in GADM language.\nNote that the GPSLAT and GPSLONG are displaced coordinates of the EA centroid. This is because PMA randomly displaces the geographic coordinates to preserve the privacy of survey respondents. Coordinates are displaced randomly by both angle and distance. Urban EAs are displaced from their true location up to 2 km. Rural EAs are displaced from their true location up to 5 km. Additionally, a random sample of 1% of rural EAs are displaced up to 10km. The PMA GPS data come with documentation that explains the displacement in more detail. The primary spatial package we’ll use is simple features or sf. We’ll use sf::st_as_sf() to convert the GPS data to a spatial data object (known as a simple feature collection).\n\nPMA follows the same displacement protocol as the Demographic and Health Surveys, for those familiar the the DHS spatial data.\n\n\ngps <- gps %>%\n    st_as_sf(\n      coords = c(\"GPSLONG\", \"GPSLAT\"), \n      crs = 4326) # 4326 is the coordinate reference system (CRS) identifier for WGS84\ngps\n\n\nSimple feature collection with 83 features and 5 fields\ngeometry type:  POINT\ndimension:      XY\nbbox:           xmin: -5.18865 ymin: 9.883331 xmax: 1.634087 ymax: 14.39679\ngeographic CRS: WGS 84\n# A tibble: 83 x 6\n   PMACC PMAYEAR REGION               EA_ID DATUM             geometry\n * <chr>   <dbl> <chr>                <dbl> <chr>          <POINT [°]>\n 1 BF       2017 5. centre-nord        7610 WGS84 (-1.065238 12.93839)\n 2 BF       2017 1. boucle-du-mouhoun  7820 WGS84 (-4.065366 12.72985)\n 3 BF       2017 3. centre             7271 WGS84 (-1.583361 12.37884)\n 4 BF       2017 3. centre             7799 WGS84 (-1.540024 12.40452)\n 5 BF       2017 8. est                7243 WGS84 (0.3797186 12.07097)\n 6 BF       2017 6. centre-ouest       7026 WGS84 (-2.366313 12.26087)\n 7 BF       2017 3. centre             7859 WGS84 (-1.570808 12.33761)\n 8 BF       2017 3. centre             7725 WGS84 (-1.552744 12.33411)\n 9 BF       2017 6. centre-ouest       7390 WGS84 (-2.211783 12.09784)\n10 BF       2017 11. plateau-central   7104 WGS84 (-1.909244 12.76427)\n# … with 73 more rows\n\nNow that gps is a simple features object, we’ve lost the GPSLAT and GPSLONG variables and gained a variable called geometry, which contains the spatial information for this data.\nThe last thing we need is the Burkina Faso shapefile. GADMTools will allow us to download and load shapefiles. Conveniently, GADMTools::gadm_sf_loadCountries() will load the shapefile as an sf object. The bf_1 object is a list which contains some metadata that we don’t need to hold onto, in addition to the shapefile, so we’ll only take what we need. Note that here the geometry variable is a POLYGON, whereas in the gps data it is a POINT.\n\n\nbf_1 <- gadm_sf_loadCountries(\n  fileNames = \"BFA\", # the ISO-3166-1 country code \n  basefile = \"data/\", # the directory where the shapefile will be saved\n  level = 1) # indicates that we want administrative level 1\n\nbf_1 <- bf_1$sf\nbf_1\n\n\nSimple feature collection with 13 features and 5 fields\ngeometry type:  POLYGON\ndimension:      XY\nbbox:           xmin: -5.518918 ymin: 9.401108 xmax: 2.4054 ymax: 15.08259\ngeographic CRS: WGS 84\nFirst 10 features:\n   ISO       NAME_0            NAME_1 TYPE_1 ENGTYPE_1\n1  BFA Burkina Faso Boucle du Mouhoun Région    Region\n6  BFA Burkina Faso          Cascades Région    Region\n11 BFA Burkina Faso            Centre Région    Region\n7  BFA Burkina Faso        Centre-Est Région    Region\n8  BFA Burkina Faso       Centre-Nord Région    Region\n9  BFA Burkina Faso      Centre-Ouest Région    Region\n10 BFA Burkina Faso        Centre-Sud Région    Region\n12 BFA Burkina Faso               Est Région    Region\n13 BFA Burkina Faso      Haut-Bassins Région    Region\n2  BFA Burkina Faso              Nord Région    Region\n                         geometry\n1  POLYGON ((-4.48801 11.79912...\n6  POLYGON ((-4.16146 9.801042...\n11 POLYGON ((-1.72342 12.09224...\n7  POLYGON ((-0.4919499 11.014...\n8  POLYGON ((-0.6313 12.54146,...\n9  POLYGON ((-1.88221 10.98227...\n10 POLYGON ((-0.9030276 10.971...\n12 POLYGON ((0.7639515 10.9973...\n13 POLYGON ((-5.08715 10.82588...\n2  POLYGON ((-2.3256 12.65788,...\n\nMerge and Map\nNow that we have all our data, we’ll show you how to map variables… But before we do that, let’s do some basic, exploratory mapping.\nExploratory Maps\nggplot2 has support for sf objects, which makes it really easy to map things using the ggplot2::geom_sf(). geom_sf() will automatically identify what kind of spatial data you’re plotting and handle it appropriately. For example, let’s plot the gps data (which are points) and the administrative region (which are polygons).\n\n\n# Plot EA centroids\nggplot() +\n  geom_sf(data = gps)\n\n\n\n# Plot regions of Burkina Faso\nggplot() +\n  geom_sf(data = bf_1)\n\n\n\n\nThe building-block approach of ggplot2 (“Grammar of Graphics”) also makes it really easy to layer different spatial features on the same map.\n\n\n# Plot regions of Burkina Faso & EA centroids on the same map\nggplot() +\n  geom_sf(data = bf_1) +\n  geom_sf(data = gps)\n\n\n\n\nMerge GPS and SDP Data\nTo map the EA-level variables constructed in the last post, we need to merge the sdp data and the gps data by EA_ID. First, let’s rename the EASEARVED variable to match the GPS data and then use a dplyr::right_join to merge in the SDP data. We need to use a right_join() because the sf object must be listed first in our join command to retain the sf class, but we want to ensure that all rows from sdp are preserved.\n\nRemember, the SDP data contains information from both 2017 and 2018, while the GPS data has a single observation per EA.\n\n\n# check <- sdp %>%\n#   group_by(EA_ID) %>%\n#   tally() %>%\n#   filter(n == 1)\n# \n# sdp[sdp$EA_ID %in% check$EA_ID,]\n\n# rename to be consistent with GPS data\nsdp <- sdp %>%\n  rename(\n    EA_ID = EASERVED \n  )\n\nsdp <- right_join(gps, sdp, by = \"EA_ID\")\n\nsdp # now the sdp data is an sf object\n\n\nSimple feature collection with 149 features and 20 fields\ngeometry type:  POINT\ndimension:      XY\nbbox:           xmin: -5.18865 ymin: 9.883331 xmax: 1.634087 ymax: 14.39679\ngeographic CRS: WGS 84\n# A tibble: 149 x 21\n   PMACC PMAYEAR REGION EA_ID DATUM                  geometry  YEAR\n   <chr>   <dbl> <chr>  <dbl> <chr>               <POINT [°]> <int>\n 1 BF       2017 5. ce…  7610 WGS84      (-1.065238 12.93839)  2017\n 2 BF       2017 5. ce…  7610 WGS84      (-1.065238 12.93839)  2018\n 3 BF       2017 1. bo…  7820 WGS84      (-4.065366 12.72985)  2017\n 4 BF       2017 1. bo…  7820 WGS84      (-4.065366 12.72985)  2018\n 5 BF       2017 3. ce…  7271 WGS84      (-1.583361 12.37884)  2017\n 6 BF       2017 3. ce…  7799 WGS84      (-1.540024 12.40452)  2017\n 7 BF       2017 8. est  7243 WGS84      (0.3797186 12.07097)  2017\n 8 BF       2017 8. est  7243 WGS84      (0.3797186 12.07097)  2018\n 9 BF       2017 6. ce…  7026 WGS84      (-2.366313 12.26087)  2017\n10 BF       2017 6. ce…  7026 WGS84      (-2.366313 12.26087)  2018\n# … with 139 more rows, and 14 more variables: N_SDP <int>,\n#   N_SDP_INT <int>, HOSPITAL <int>, HCENTER <int>, PHARM <int>, …\n\nMap SDP data\nRemember, the sdp data contains information from 2017 & 2018, which can clog up the map depending on how we use this information. To start out, let’s use only the 2017 data and add information about the number of service delivery providers that serve a given EA (N_SDP). By passing N_SDP to the size aesthtic, we can more easily visualize how EAs vary in their access to service delivery providers.\n\n\nsdp2017 <- sdp %>%\n  filter(YEAR == 2017)\n\nggplot() +\n  geom_sf(data = bf_1) +\n  geom_sf(data = sdp2017, aes(size = N_SDP),\n          alpha = 0.4) \n\n\n\n\n\n\n\n",
    "preview": "posts/2021-01-15-mapping-sdp-variables/mapping-sdp-variables_files/figure-html5/unnamed-chunk-4-1.png",
    "last_modified": "2021-01-19T11:58:23-06:00",
    "input_file": {},
    "preview_width": 1248,
    "preview_height": 768
  },
  {
    "path": "posts/2020-12-09-mapping-contraceptive-stockouts/",
    "title": "Mapping contraceptive stockouts",
    "description": "Build an interactive map showing the percentage of service providers reporting a recent stockout of contraceptive methods",
    "author": [
      {
        "name": "Matt Gunther",
        "url": {}
      }
    ],
    "date": "2020-12-17",
    "categories": [
      "R",
      "Shiny",
      "tmap",
      "Mapping",
      "Contraceptive Stockouts",
      "Serivce Delivery Points"
    ],
    "contents": "\n\nContents\nContraceptive Stockouts\nHow it’s madeData\nUser input options\nShiny application\n\n\n\n\n Download this page as R code\n\n\nContraceptive Stockouts\nPercentage of facilities experiencing a recent empty stock of each method, relative to the number of facilities in each region / province that normally provide the method (all survey years combined)\n\nA “recent” stockout includes any stockout experienced within 3 months prior to the survey.\n\n\n\n\nMissing regions / provinces include those with no surveyed facilities and those where no surveyed facilities normally provide the method.\nHow it’s made\nThe R package Shiny makes it possible to create graphics that respond to user input. In example above, the user can provide three types of input:\nChoose a country: a dropdown menu with 3 choices\nChoose a method: a dropdown menu with 14 choices\nInteractions with the map (zoom, drag, filter, hover, and click)\nWe’ll use the Shiny function shinyApp to collect user input with a “ui” function, and then serve the requested data back to the user with a “server” argument. If you run the code for this application on your own, RStudio will launch a viewer window and continue managing the ui and server until you manually stop the process. To host an application on a website (like we’ve done here), you’ll need to “deploy” it to a server that can run R on demand (read more here).\nShiny provides dropdown menus automatically with the selectInput function, so we only need to provide the input labels and ensure that each one corresponds with an option available in the data file.\nMapping tools, however, are not provided by Shiny. Instead, we’ll render our map with the tmap package, which also contains functions that will handle all of the user’s interactions with our map.\n\n\nlibrary(tidyverse)\nlibrary(shiny)\nlibrary(tmap)\n\n\n\nData\nTo keep things simple, we’ll just look at three countries (Ethiopia, Kenya, and Uganda) and combine stockout data for all available survey years.\nCreate a data extract with the following Family Planning - Service Delivery Point geographic variables:\nGEOET\nGEOKE\nGEOUGGEN\nand these variables from the contraceptive stock group:\nCONOUT3MO\nCYCBOUT3MO\nDEPOOUT3MO\nDIAOUT3MO\nEMRGOUT3MO\nFCOUT3MO\nFJOUT3MO\nIMPOUT3MO\nINJOUT3MO\nIUDOUT3MO\nOTHEROUT3MO\nPILLOUT3MO\nPROPILLOUT3MO\nSAYOUT3MO\n(Some variables, like COUNTRY and YEAR, are included automatically with every extract: no need to select those.)\nLoad the data as an object, dat:\n\n\ndat <- ipumsr::read_ipums_micro(\n  ddi = \"resources/pma_00007.xml\",\n  data = \"resources/pma_00007.dat.gz\"\n)\n\n\n\n\nRemember: replace both file names with your own paths and extract number!\nWe also need one “simple features” dataset for each of the three maps we’ll want to render. I used sf::st_read to get these files from highcharts, then cleaned up some of the longer region / province names. I created these files ahead of time: you’ll find them in the “resources” folder for this post in the PMA Data Hub repository on GitHub.\n\n\net_map <- read_rds(\"resources/et_map.rds\")\nke_map <- read_rds(\"resources/ke_map.rds\")\nug_map <- read_rds(\"resources/ug_map.rds\")\n\n\n\nUser input options\nRather than using variable names in the dropdown menus, create user-friendly labels corresponding to each of the stockout variables and the COUNTRY options we’ll be using:\n\n\nmethods <- c(\n  \"MALE CONDOMS\" = \"CONOUT3MO\",\n  \"FEMALE CONDOMS\" = \"FCOUT3MO\",\n  \"CYCLE BEADS\" = \"CYCBOUT3MO\",\n  \"DIAPHRAGM\" = \"DIAOUT3MO\",\n  \"EMERGENCY METHOD\" = \"EMRGOUT3MO\",\n  \"FOAM / JELLY\" = \"FJOUT3MO\",      \n  \"IMPLANTS\" = \"IMPOUT3MO\",     \n  \"INJECTABLE\" = \"INJOUT3MO\",    \n  \"IUD\" = \"IUDOUT3MO\",     \n  \"PILL\" = \"PILLOUT3MO\",    \n  \"DEPO PROVERA\" = \"DEPOOUT3MO\",    \n  \"SAYANA PRESS\" = \"SAYOUT3MO\",  \n  \"PROGESTIN PILLS\" = \"PROPILLOUT3MO\",\n  \"OTHER\" = \"OTHEROUT3MO\"\n)\n\ncountries <- c(\n  \"UGANDA\",\n  \"KENYA\",\n  \"ETHIOPIA\"\n)\n\n\n\nShiny application\nThe user interface (“ui”) creates a page divided into two sections with sidebarLayout: the sidebarPanel holds our two dropdown menus and some help text, while the mainPanel holds the dynamic output rendered by renderTmap in our application’s “server” function.\nThe “server” function takes input from the user interface. When a user chooses a country, it picks the correct simple features object map and then groups the data by region / province using the appropriate geographic variable (GEOUGGEN, GEOKE, or GEOET). Next, it creates a table showing the total number of service providers in each region / province that did and did not experience a recent stockout N. It transforms these counts into percentages by region PCT, calculates the total number of service providers TOT, and attaches that information to map.\nEverything else is handled by tmap functions, including dynamic information rendered as the user clicks, drags, or hovers their mouse over the map.\n\n\nshinyApp(\n  ui = fluidPage(\n    sidebarLayout(\n      sidebarPanel(\n        selectInput(\"country\", \"Choose a country\", choices = countries),\n        selectInput(\"method\", \"Choose a method\", choices = methods),\n        helpText(\n          \"Click on any region / province for more information\" %>% \n          em() %>% \n          strong()\n        ),\n        helpText(\n          \"Drag and scroll to resize\" %>% \n          em() %>% \n          strong()\n        )\n      ), \n      mainPanel(\n        tmapOutput(\"map\")\n      )\n    )\n  ),\n  server = function(input, output, session){\n    output$map <- renderTmap({\n      if(input$country == \"UGANDA\"){\n        map <- ug_map\n        groups <- \"GEOUGGEN\"\n      } else if(input$country == \"KENYA\"){\n        map <- ke_map\n        groups <- \"GEOKE\"\n      } else if(input$country == \"ETHIOPIA\"){\n        map <- et_map\n        groups <- \"GEOET\"\n      }\n      \n      method <- input$method\n      \n      map <- dat %>%\n        filter(!!sym(method) %in% c(0, 1, 97)) %>% #keep yes, no, don't know\n        group_by(!!sym(groups)) %>% \n        count(X = !!sym(method) == 0, name = \"N\") %>%\n        mutate(PCT = 100*N/sum(N)) %>%\n        pivot_wider(\n          id_cols = !!sym(groups),\n          names_from = X,\n          values_from = c(N, PCT)\n        ) %>%\n        mutate(TOT = N_TRUE + N_FALSE) %>%\n        ungroup() %>%\n        rename(\n          name = !!sym(groups),\n          \"Pct. SDPs\" = PCT_FALSE\n        )  %>% \n        filter(!is.na(name)) %>%\n        mutate(full_name = as_factor(name) %>% as.character) %>% \n        left_join(map, ., by = \"name\") %>%\n        mutate(    \n          id = as_factor(full_name) %>% as.character,\n          name = id,\n          OBJECTID = id\n        ) \n      \n      tm_shape(map) +\n        tm_basemap(NULL) +\n        tm_polygons(\n          \"Pct. SDPs\", \n          alpha = 0.9,\n          border.alpha = 0.3, \n          palette = c(\n            \"#F0E6F0\", # gray\n            \"#98579B\", # pink\n            \"#13374C\" # blue\n          ),\n          breaks = c(seq(0, 35, by = 5), Inf),\n          popup.vars = c(\n            \"SDPs that normally supply (all yrs)\" = \"TOT\",\n            \"SDPs with recent stockout (3 mo)\" = \"N_FALSE\",\n            \"Pct. of suppliers with recent stockout (3 mo)\" = \"Pct. SDPs\"\n          )\n        )\n    })\n  }\n)\n\n\n\n\n\n\n",
    "preview": "posts/2020-12-09-mapping-contraceptive-stockouts/images/static-map.png",
    "last_modified": "2020-12-18T15:46:02-06:00",
    "input_file": {},
    "preview_width": 574,
    "preview_height": 400
  },
  {
    "path": "posts/2020-12-08-linking-maternal-and-newborn-records/",
    "title": "Linking Maternal and Newborn Records in 2018 Nutrition Surveys",
    "description": "How to build a rowwise function linking children to mothers in the 2018 Nutrition Surveys for Burkina Faso and Kenya.",
    "author": [
      {
        "name": "Matt Gunther",
        "url": {}
      }
    ],
    "date": "2020-12-08",
    "categories": [
      "Data Manipulation",
      "Nutrition",
      "Burkina Faso",
      "R",
      "purrr"
    ],
    "contents": "\n\nContents\nSetup\nLinking by household and birthdateHow does it work?\nResults\n\nSearching for Additional CasesAdditional Results\n\nAnalysis\n\n\n\n Download this page as R code\n\n\nThe PMA 2018 nutrition survey module for Burkina Faso and Kenya contains hundreds of indicators measuring diet and nutritional status for women aged 10-49 and children under age 5. In some households, the 2018 survey design included both children and their biological mother, but their relationships are not immediately available in the data.\nThis post shows how to write an R function that will link child and maternal records, provided that both mother and child were surveyed. These links may be particularly useful for researchers studying the effectiveness of different antenatal interventions on early childhood nutrition.\nFor example, we’ll examine a variable RPFEEDINFO that asked mothers whether they ever received information about how to feed their newborn during an antenatal care visit for their recent pregnancy. This information is stored only in the row containing the mother’s record, but - if we can successfully link a mother to her child - we’ll then attach it to the row containing the child’s record. Then, we’ll be able to compare it with a measure of the now-living child’s growth KIDARMCIRCVAL to see whether children whose mother received the antenatal intervention have fared better in the first years of life.\n\nThis question was posed only to mothers who gave birth within the last 2 years and received some type of antenatal care during that pregnancy. As a result, we’ll restrict our analysis to the children under age 2 that we’re able to link to a maternal record.\nSetup\nTo run the code in this post, you’ll need the tidyverse package from CRAN. See our post Installing and Loading Useful R Packages for help.\n\n\nlibrary(tidyverse)\n\n\n\nTo keep things simple, we’ll focus on 2018 Nutrition data from Burkina Faso, which you can download at pma.ipums.org. See our post Downloading an IPUMS Extract for R for help.\n\n\nbf2018 <- ipumsr::read_ipums_micro(\n  ddi = \"pma_00001.xml\",\n  data_file = \"pma_00001.dat.gz\"\n)\n\n\n\n\nRemember: replace both file names with your own paths and extract number!\nLinking by household and birthdate\nThe easiest way to match mothers and children is to look within each household for a child whose date of birth KIDBIRTHYR and KIDBIRTHMO matches the birth record data for any women living in that same household. The 2018 Nutrition survey only contains dates for each woman’s most recent birth in LASTBIRTHYR and LASBIRTHMO, so we can only match a mother to her most recent child.\nWhile this approach won’t match every mother and child, we can safely assume that we’ve found a correct pair in each household if we also make sure that the birthdates allow for only one possible match. For example, if two women in the same household last gave birth in the same month and year, we should make sure to exclude them (since we wouldn’t be able to tell which mother matches which child).\n\n\nbf2018 <- bf2018 %>% \n  group_by(HHID) %>% \n  mutate(MOMID = case_when(ELIGTYPE < 20 ~ pmap_chr(\n    cur_data() %>%\n      select(KIDBIRTHYR,\n             KIDBIRTHMO,\n             LASTBIRTHYR,\n             LASTBIRTHMO), \n    function(...){\n      kid <- tibble(...)\n      sameYr <- which(LASTBIRTHYR == kid$KIDBIRTHYR)\n      sameMo <- which(LASTBIRTHMO == kid$KIDBIRTHMO)\n      mom <- intersect(sameYr, sameMo)\n      if(length(mom)==1){return(PERSONID[mom])}else{return(NA)}\n    }\n  ))) %>% \n  ungroup() \n\n\n\nHow does it work?\nWe create a variable MOMID that stores the unique person identifier PERSONID for each child’s mother.\nTo find each child’s mother, we restrict our search to individuals living in the same household (group_by(HHID)). Then, using ELIGTYPE we assign MOMID only to child records by selecting cases where ELIGTYPE < 20.\nThen, for each child in the household, we use the pmap_chr() function to examine each of the records for individuals who live with the child. For sake of speed, we pass only the variables KIDBIRTHYR, KIDBIRTHMO, LASTBIRTHYR, and LASTBIRTHMO to the anonymous function inside pmap_chr.\nFinally, kid <- tibble(...) stores a temporary one-row data frame containing information on the child, which we can then reference with kid$BIRTHYR and kid$BIRTHMO. As pmap_chr iterates through each household member, it assigns mom to any person who gave birth on the child’s birthday. If only one person fits, that person’s PERSONID becomes the child’s MOMID.\nResults\nIn total, 796 children were linked to a mother: this is only about 28% of the 2856 children listed by the grouping variable ELIGTYPE:\n\n\nbf2018 %>% count(ELIGTYPE, HASMOMID = !is.na(MOMID))\n\n\n# A tibble: 9 x 3\n                                               ELIGTYPE HASMOMID     n\n                                              <dbl+lbl> <lgl>    <int>\n1 11 [Infant under age 2 (INF)]                         FALSE      731\n2 11 [Infant under age 2 (INF)]                         TRUE       463\n3 14 [Aged 2-5 (K)]                                     FALSE     1329\n4 14 [Aged 2-5 (K)]                                     TRUE       333\n5 20 [Selected women aged 10-49 (WN)]                   FALSE     2411\n6 31 [Member of household included in nutrition sample] FALSE     9045\n7 32 [Member of household excluded from nutrition samp… FALSE     3535\n8 95 [Not interviewed (female questionnaire)]           FALSE       51\n9 96 [Not interviewed (household questionnaire)]        FALSE      101\n\nWhy were so few children matched successfully? Part of the answer has to do with the nutrition sample design: in Burkina Faso, women aged 10-49 were included from just 45% of households selected at random from the household screening sample (in the Kenya 2018 sample, 25% of households were randomly selected). As a result, we might estimate that only around 45% of children could possibly be linked to mother included in the nutrition sample:\n\n\nbf2018 %>%\n  mutate(MOMS_IN_HH = case_when(ELIGTYPE < 20 ~ pmap_chr(\n    cur_data() %>%\n      select(HHID, ELIGTYPE), \n    function(...){\n      kid <- tibble(...)\n      sameHH <- which(HHID == kid$HHID & ELIGTYPE == 20)\n      if(length(sameHH)>0){return(\"yes\")}else{return(\"no\")}\n    }\n  ))) %>%\n  group_by(ELIGTYPE, MOMS_IN_HH) %>%\n  count()\n\n\n# A tibble: 9 x 3\n# Groups:   ELIGTYPE, MOMS_IN_HH [9]\n                                             ELIGTYPE MOMS_IN_HH     n\n                                            <dbl+lbl> <chr>      <int>\n1 11 [Infant under age 2 (INF)]                       no           655\n2 11 [Infant under age 2 (INF)]                       yes          539\n3 14 [Aged 2-5 (K)]                                   no           924\n4 14 [Aged 2-5 (K)]                                   yes          738\n5 20 [Selected women aged 10-49 (WN)]                 <NA>        2411\n6 31 [Member of household included in nutrition samp… <NA>        9045\n7 32 [Member of household excluded from nutrition sa… <NA>        3535\n8 95 [Not interviewed (female questionnaire)]         <NA>          51\n9 96 [Not interviewed (household questionnaire)]      <NA>         101\n\nThis confirms our estimate: only 1277 of the 2856 sampled children live in a household with a woman aged 10-49 who was also included in the nutrition sample. In other words, 45% of sampled children live in a household with a sampled mother. Our search found matches for 28% of all children, but this reflects 62% of the children who live in a household with a sampled mother.\nFortunately, because households were randomly selected for the female nutrition sample, we should have no reason to suspect that the 796 children matched to mothers by our search criteria represent a biased sub-sample of the 2856 children overall. However, before proceeding with further analysis, it would be worthwhile to see if we can increase the number of linked children with additional search criteria.\nSearching for Additional Cases\nIn the example above, the use of LASTBIRTHMO and LASTBIRTHYR ensured that only mother’s most recent child could be linked to her record.\nIt’s possible to expand these criteria in certain circumstances using RELATEKID, which describes the relationship between each child and the person who provided responses to the interviewer on their behalf.\nWhen RELATEKID == 1, the respondent to the child’s questionnaire is the child’s mother. So, if RELATEKID == 1 and if only one woman in the child’s household has ever given birth, we could reasonably identify that person as the child’s mother.\n\n\nbf2018 <- bf2018 %>%\n  group_by(HHID) %>% \n  mutate(MOMID = case_when(\n    ELIGTYPE < 20 ~ pmap_chr(\n      cur_data() %>% \n        select(\n          KIDBIRTHYR,\n          KIDBIRTHMO,\n          LASTBIRTHYR,\n          LASTBIRTHMO,\n          RELATEKID\n        ), \n      function(...){\n        kid <- tibble(...)\n        sameYr <- which(LASTBIRTHYR == kid$KIDBIRTHYR)\n        sameMo <- which(LASTBIRTHMO == kid$KIDBIRTHMO)\n        mom <- intersect(sameYr, sameMo)\n        moms_in_hh <- which(LASTBIRTHYR < 9000)\n        if(length(mom) == 1){ \n          return(PERSONID[mom])\n        }else if(length(moms_in_hh) == 1 & kid$RELATEKID == 1){\n          return(PERSONID[moms_in_hh])\n        }else{\n          return(NA)\n        }\n      }\n    )\n  )) %>% \n  ungroup()\n\n\n\nThis is the same function as before, but with one major addition. We count all of the women in the child’s household who have ever given birth moms_in_hh. If our previous method doesn’t identify the child’s mother, we then look to see if there’s only one mother in the household length(moms_in_hh) == 1 and if the respondent for the child’s questionnaire was their mother kid$RELATEKID == 1.\nAdditional Results\nWith these expanded search criteria, 1079 children were matched to a mother’s record: an improvement by 283 cases!\n\n\nbf2018 %>% count(ELIGTYPE, HASMOMID = !is.na(MOMID))\n\n\n# A tibble: 9 x 3\n                                               ELIGTYPE HASMOMID     n\n                                              <dbl+lbl> <lgl>    <int>\n1 11 [Infant under age 2 (INF)]                         FALSE      688\n2 11 [Infant under age 2 (INF)]                         TRUE       506\n3 14 [Aged 2-5 (K)]                                     FALSE     1089\n4 14 [Aged 2-5 (K)]                                     TRUE       573\n5 20 [Selected women aged 10-49 (WN)]                   FALSE     2411\n6 31 [Member of household included in nutrition sample] FALSE     9045\n7 32 [Member of household excluded from nutrition samp… FALSE     3535\n8 95 [Not interviewed (female questionnaire)]           FALSE       51\n9 96 [Not interviewed (household questionnaire)]        FALSE      101\n\nBecause only 1277 children in the nutrition sample live with a sampled mother, we have now established almost 85% of the possible links between mothers and children.\nHowever, these additional 283 cases should be used with some degree of caution: they represent children from smaller households compared to the remaining 15% ofchildren who, for the most part, live in households where more two or more mothers reside together. Further analysis should determine whether and how the selection of these smaller households might bias the social and economic composition of our sub-sample.\nAnalysis\nNow that we’ve linked as many children as possible to their mother’s records, we can create a new variable MOMINFO on the child’s record indicating whether their mother received newborn feeding information as a part of antenatal care during the pregnancy. We’ll get this information from RPFEEDINFO on the mother’s record.\nWe’ll then take each child’s mid-upper arm circumference KIDARMCIRCVAL as a simple proxy measure for growth and nutrition. Comparing children whose mothers received newborn feeding information to those whose mothers received none, no real difference seems to exist (at least not without additional control variables):\n\n\nx_lab <- \"Child's mid-upper arm circumference (MUAC)\"\n\nlegend_lab <- str_wrap(\n  \"Mother received newborn feeding information during antenatal care\", \n  15\n)\n\nbf2018 %>%\n  filter(!is.na(MOMID)) %>%\n  rowwise() %>%\n  mutate(MOMINFO = bf2018$RPFEEDINFO[which(bf2018$PERSONID == MOMID)]) %>% \n  filter(MOMINFO %in% 0:1 & KIDARMCIRCVAL < 90) %>%\n  mutate(MOMINFO = as_factor(MOMINFO)) %>%\n  ggplot(aes(KIDARMCIRCVAL, color = MOMINFO, fill = MOMINFO)) +\n    geom_density(alpha = 0.2) +\n    scale_color_manual(values = c(\"#00263A\", \"#98579B\")) +\n    scale_fill_manual(values = c(\"#00263A\", \"#98579B\")) + \n    labs(x = x_lab, color = legend_lab, fill = legend_lab)\n\n\n\n\nOr course, much more could be done to investigate the relationship between antenatal interventions and the growth of young children. Let us know what you uncover by linking mothers to children in the 2018 nutrition data!\n\n\n\n",
    "preview": "posts/2020-12-08-linking-maternal-and-newborn-records/linking-maternal-and-newborn-records_files/figure-html5/unnamed-chunk-8-1.png",
    "last_modified": "2020-12-18T15:46:02-06:00",
    "input_file": {},
    "preview_width": 1248,
    "preview_height": 768
  },
  {
    "path": "posts/2020-12-14-womens-empowerment-factor-analysis/",
    "title": "Locating Dimensions of Women’s Empowerment in Family Planning in Burkina Faso",
    "description": "Use factor analysis to identify groups of attitudes, behaviors, and traits",
    "author": [
      {
        "name": "Tayler Nelson",
        "url": {}
      }
    ],
    "date": "2020-11-20",
    "categories": [
      "Burkina Faso",
      "Factor Analysis",
      "Stata"
    ],
    "contents": "\nThis post first appeared at the IPUMS Blog\n\n\n Download the Stata do-file for this post\n\n\nWomen’s “empowerment,” defined by Naila Kabeer (2001) as “the expansion of people’s ability to make strategic life choices in a context where this ability was previously denied to them,” has been shown to be associated with greater birth spacing, lower fertility, and lower rates of unplanned pregnancy (Upadhyay et al. 2014). Yet scholars disagree on how to measure women’s empowerment, and meanings of empowerment can shift across geographic and cultural contexts (Prata et al. 2017).\nIPUMS PMA’s family planning surveys include variables that can help researchers investigate dimensions of women’s empowerment in family planning. All samples include indicators of women’s knowledge about family planning methods. Many survey rounds dig deeper, collecting data that can be used by researchers and policymakers.\nThe Burkina Faso 2018 Round 6 survey includes a range of variables measuring family planning attitudes, beliefs, and decision-making dynamics that relate to women’s empowerment. I used a weighted polychoric factor analysis to investigate women’s empowerment in family planning in Burkina Faso. Factor analysis can help researchers reduce a large number of observed variables by identifying similar response patterns among observed variables and grouping them into a smaller set of underlying variables, or factors. Through analyzing how variables are grouped and the strength and signs of coefficients within these groups, researchers can glean insight into which sets of observed variables might be best at measuring an unobserved construct such as women’s empowerment.\n\nI used Stata’s polychoric function in order to include a mix of binary and ordinal variables in my analysis.\nAfter reviewing the literature on women’s empowerment in family planning, I selected nineteen PMA variables to capture dimensions of women’s empowerment in family planning in Burkina Faso. These included social context variables (URBAN, WEALTHQ, EDUCATTGEN), whether the woman is a current/recent family planning user (FPCURRECUSER), whether the woman has heard of family planning on television (FPTVHR) or radio (FPRADIOHR), and belief and attitude variables that use a Likert scale to measure how much the woman agrees with a particular statement about family planning (SAFEDISCKID, SAFEDISCFP, CONFLICTFP, DAMRELFP, NEGOTIATEKIDS, BELIEFCARRYPREG, BELIEFDAUPREG, AGREESPACE, AGREELIMIT, AGREECONTR, AGREEFP, AGREEPARTFP). I also combined two variables that measure who is the primary decision-maker in deciding to use (FPDECIDER) or not to use (DECNOFPUSE) family planning into a single ordinal variable (DECIDER) that reports how much input a woman has in the couple’s family planning decisions. I excluded not in universe (NIU) and missing cases as well as females who were not married or partnered; my analytical sample contained 1,686 women. All analyses applied appropriate sampling weights.\nI retained three factors and analyzed which characteristics or beliefs relate to each underlying factor by examining variable groupings and factor loadings. Table 1 displays all factor loadings above 0.3 for each variable. Looking at high factor loadings can help researchers identify underlying factors. I have marked moderate and strong factor loadings in the table with an asterisk(*).\nI used Eigenvalues and scree plots to determine how many factors to retain.\nI am defining moderate and strong factor loadings as those loadings of .60 and greater.\n\n\nVARIABLE\n\n\nDESCRIPTION\n\n\nF1\n\n\nF2\n\n\nF.3\n\n\nURBAN\n\n\nUrban/rural status\n\n\n\n\n.94 *\n\n\n\n\nWEALTHQ\n\n\nWealth score quintile\n\n\n\n\n.87 *\n\n\n\n\nEDUCATTGEN\n\n\nHighest level of schooling attended\n\n\n\n\n.66 *\n\n\n\n\nFPCURRECUSER\n\n\nCurrent or recent FP user\n\n\n\n\n0.32\n\n\n\n\nDECIDER\n\n\nWomen’s level of say in decisions about whether to use/not use FP\n\n\n\n\n\n\n\n\nSAFEDISCKID\n\n\nSafe to discuss when to have children w/ partner\n\n\n.66 *\n\n\n\n\n\n\nSAFEDISCFP\n\n\nSafe to discuss FP w/ partner\n\n\n.71 *\n\n\n\n\n\n\nCONFLICTFP\n\n\nConflict in relationship if used FP\n\n\n-0.5\n\n\n\n\n\n\nDAMRELFP\n\n\nDelaying or limiting children would deteriorate relationship w/ partner\n\n\n-0.44\n\n\n\n\n\n\nNEGOTIATEKIDS\n\n\nAble to negotiate w/ partner when to stop having children\n\n\n.65 *\n\n\n\n\n\n\nBELIEFCARRYPREG\n\n\nThinks a woman should not get pregnant if child still on her back\n\n\n\n\n\n\n.60 *\n\n\nBELIEFDAUPREG\n\n\nThinks a woman should not get pregnant if daughter is pregnant\n\n\n\n\n\n\n0.48\n\n\nAGREESPACE\n\n\nAgrees with couple that uses FP to space births\n\n\n0.45\n\n\n\n\n0.44\n\n\nAGREELIMIT\n\n\nAgrees with couple that uses FP to limit births\n\n\n0.52\n\n\n\n\n\n\nAGREECONTR\n\n\nAgrees with man/woman that uses contraception\n\n\n0.34\n\n\n\n\n\n\nAGREEFP\n\n\nAgrees with couples that use FP\n\n\n0.59\n\n\n\n\n0.39\n\n\nAGREEPARTFP\n\n\nPartner agrees with couples that use FP\n\n\n.69 *\n\n\n\n\n\n\nFPTVHR\n\n\nHeard about FP on TV\n\n\n\n\n.66 *\n\n\n0.38\n\n\nFPRADIOHR\n\n\nHeard about FP on the radio\n\n\n\n\n\n\n0.33\n\n\nFactor 1 includes the majority of attitude and belief variables. I looked at similarities and differences between variables and their factor loadings to interpret this factor. Variables with high factor loadings all relate to good spousal communication around family planning. For instance, SAFEDISCFP, which reports how much the respondent agrees that it is safe to discuss family planning with her partner, has the highest factor loading. Variables related to spousal conflict, such as CONFLICTFP, have weak but negative factor loadings. Together, these results indicate that Factor 1 might be a latent measure of spousal communication. Alternative interpretations are possible: for example, it might be that this factor simply represents support for family planning, and variables with high factor loadings are the most useful observed indicators of this factor.\n\nI looked for common conceptual threads between the highest factor loadings (asking myself, ‘What latent factor might all of these variables be measuring?’). I also looked at weak and negative factor loadings to help interpret this factor.\nFor Factor 2, the high factor loadings for URBAN and WEALTHQ suggest that this factor indicates socioeconomic status. The variable for whether the woman has heard about family planning on TV loads moderately highly on this factor; this seems logical assuming TV ownership is a reflection of socioeconomic status.\nFor Factor 3, the factor loadings are relatively small except for the loading for the belief that women should not get pregnant if she is still carrying a child on her back. In line with a Burkina Faso 2014 report that found popular acceptance of family planning for spacing rather than limiting births and stigma around women who have children too closely together, this factor might indicate adherence to traditional Burkina Faso beliefs around family planning. AGREESPACE, which reports the respondent’s agreement with couples using contraception to space the birth of their children, also loads on this factor. This factor may indicate value of traditional beliefs or more explicit support for child spacing.\nThis factor analysis indicates several dimensions of empowerment for understanding family planning in Burkina Faso and suggests a handful of important variables (those with high factor loadings) users may be interested in including in analyses of female empowerment. It also highlights other areas to explore. For example, I was surprised that DECIDER was not strongly associated with any single factor (though iterations of this analysis that measured joint decision-making showed high factor loading alongside the other socioeconomic status variables in Factor 2). Researchers may want to use PMA data to investigate whether spousal communication, socioeconomic status, and geographically-specific traditional beliefs remain important factors in family planning variables across different countries and years, or look further into how decision-making might align with these factors.\n\n\n\nKabeer, Naila. 2001. “Reflections on the Measurement of Women’s Empowerment.” in Discussing women’s empowerment: Theory and practice. Stockholm: SIDA: Swedish International Development Cooperation Agency.\n\n\nPrata, Ndola, Ashley Fraser, Megan J. Huchko, Jessica D. Gipson, Mellissa Withers, Shayna Lewis, Erica J. Ciaraldi, and Ushma D. Upadhyay. 2017. “Women’s Empowerment and Family Planning: A Review of the Literature.” Journal of Biosocial Science 49(6):713–43.\n\n\nUpadhyay, Ushma D., Jessica D. Gipson, Mellissa Withers, Shayna Lewis, Erica J. Ciaraldi, Ashley Fraser, Megan J. Huchko, and Ndola Prata. 2014. “Women’s Empowerment and Fertility: A Review of the Literature.” Social Science & Medicine 115:111–20.\n\n\n\n\n",
    "preview": {},
    "last_modified": "2020-12-18T15:46:02-06:00",
    "input_file": {}
  },
  {
    "path": "posts/2020-12-10-get-ipums-pma-data/",
    "title": "Import IPUMS PMA Data into R",
    "description": "How to download an IPUMS PMA data extract and start using it in R",
    "author": [
      {
        "name": "Matt Gunther",
        "url": {}
      }
    ],
    "date": "2020-11-10",
    "categories": [
      "R Tips",
      "R Packages",
      "Importing Data"
    ],
    "contents": "\n\nContents\nHow to access the dataUser Guide\nYouTube Tutorials\n\nImporting the dataFixed-width Data Format (dat)\nThe ipumsr package\n\n\nIPUMS PMA is the harmonized version of the multinational survey Performance Monitoring for Action (formerly known as Performance Monitoring and Accountability 2020 - PMA2020). IPUMS PMA lets researchers easily browse the contents of the survey series and craft customized microdata files they download for analysis.\nHow to access the data\nUser Guide\nVisit the IPUMS PMA data dissemination website to browse the available data, and then follow the posted user guide to get started with an extract of interest.\nNote: all users must register for a free account. See user guide for details.\nYouTube Tutorials\nVisit the IPUMS PMA YouTube page for a video playlist showing how to do things like:\nregister for a free IPUMS account\nselect from the available units of analysis\nbuild a data extract\nselect cases of interest\nuse the available survey weights\nImporting the data\nFixed-width Data Format (dat)\nOnce you have registered and finished selecting PMA samples and variables for your extract, click the “View Cart” button to begin checkout.\nReview the contents of your extract and clik the “Create Data Extract” button as shown:\n\n\n\nOn this final page be sure to change the data format to “.dat (fixed-width text)” if it is not selected by default:\n\n\n\nYou will receive an email when your extract request has been processed. Click the included link to find a download page like this one. You must download both the data file and the DDI codebook:\n\n\n\nThe ipumsr package\nThe R package ipumsr provides the tools you will need to import the data file and DDI codebook into R. You can install the package from CRAN with:\n\nClick here for more information on R packages.\ninstall.packages(\"ipumsr\")\nNote the location where your data file and DDI codebook were saved (in my case, they were saved in my local “Downloads” folder). Substitute your own paths into the function shown below:\n\n\ndat <- ipumsr::read_ipums_micro(\n  ddi = \"~/Downloads/pma_00001.xml\",\n  data_file = \"~/Downloads/pma_00001.dat.gz\"\n)\n\n\n\nYou’re done! The dataset is now accessible as the R object, dat.\n\n\n\n",
    "preview": "posts/2020-12-10-get-ipums-pma-data/images/create-data-extract.png",
    "last_modified": "2020-12-18T15:46:02-06:00",
    "input_file": {},
    "preview_width": 910,
    "preview_height": 790
  },
  {
    "path": "posts/2020-12-10-get-r-and-packages/",
    "title": "Getting Started with R",
    "description": "How to download R for free and install some of the R packages used on this blog",
    "author": [
      {
        "name": "Matt Gunther",
        "url": {}
      }
    ],
    "date": "2020-11-02",
    "categories": [
      "R Tips",
      "R Packages"
    ],
    "contents": "\n\nContents\nWhy analyze PMA data with R?Getting started with ROur favorite resources\n\nDo I really need statistical software?\nAre there alternatives?\n\nRStudio\nR packagesEssentialsipumsr\ntidyverse\nshiny\n\nWatch for updates here\n\n\nWhy analyze PMA data with R?\nLike all IPUMS data projects, IPUMS PMA data is available free of charge to users who agree to our terms of use. That’s because we believe that cost and institutional affiliation should not be barriers to answering pressing concerns around women’s health.\nIn fact, users can analyze IPUMS PMA data with any software they like! We’ve chosen to highlight R, in particular, because it is also free and popular with data analysts throughout the world. It’s available for Windows, MacOS, and a wide variety of UNIX platforms and similar systems (including FreeBSD and Linux).\nNon-R users: IPUMS data extracts are available as CSV or fixed-width DAT with syntax files formatted for SPSS, Stata, and SAS.\nGetting started with R\nTo get a copy of R for yourself, visit the Comprehensive R Archive Network (CRAN) and choose the right download link for your operating system.\nIf you’re new to R (or want to refresh your skills), we recommend the excellent, free introductory text R for Data Science. It also introduces tidyverse conventions, which we use throughout this blog.\nOur favorite resources\nR for Data Science, for beginners\nAdvanced R, for a deeper dive\nRSpatial, for analysis with spatial data\nggplot2, for data visualization\nMastering Shiny, for interactive applications\nR Markdown: The Definitive Guide, for producing annotated code, word documents, presentations, web pages, and more\nR-bloggers, for regular news and tutorials\n\n\n\n© 2016 The R Foundation (CC-BY-SA 4.0)\nDo I really need statistical software?\nIf you’re new to data analysis, you might wonder exactly what you’re going to find in a toolkit like R.\nPlenty of people come to R after working with more common types of data analysis software, like Microsoft Excel or other spreadsheet programs. If you wanted to, you could absolutely download a CSV file from the IPUMS PMA extract system and open it in Excel. You would find individual respondents in rows and their responses for variables in columns, and you could make use of built-in spreadsheet functions to do things like:\nCalculate and visualize the distribution of a variable\nBuild pivot tables and graphs examining basic relationships between variables\nCreate new variables of your own that combine data from several variables\nHowever, you might also notice that a spreadsheet comes with certain limitations:\nThere is no variable “metadata”, including labels for the variables and each response option. For example, you might see that the responses to a certain variable include the numbers 0, 1, and 99 - what do these values actually mean?\nYou might find yourself repeating the same “point” and “click” procedure over and over. Or, maybe you’ve had to build a library of custom macro functions on your own to help automate those procedures.\nWhile you can perform arithmetic with built-in functions, there is little support for more advanced statistical procedures\nGraphics are limited within a set of pre-built templates\nMerging data from external sources (like spatial data) can be very tricky\nStatistical software is designed specifically to address these and other issues related to data cleaning and analysis. Learning a program like R takes a lot of practice, but doing so will almost certainly make your work much more efficient!\nAre there alternatives?\nYes! Many data analysts use proprietary statistical software like Stata, SAS, or SPSS. These tools are also powerful, and you may even find them easier to use than R.\n\nComing soon, we hope to include Stata code for many of the blog posts currently written in R.\nBeyond price, R has a few additional advantages that make it a particularly useful tool for working with PMA data:\nCommunity support: R users are particularly active on forums like Stack Overflow and R-bloggers. Groups like R-ladies even organize in-person meetups in cities around the world to help promote inclusion within the R community.\nCustomizability: Because R is open-source, you can change just about anything you like! With a little practice, you’ll be able to create functions and graphics that perfectly match your own needs.\nBeyond statistics: You can use R to build a website (like this one), manage and share a code repository on GitHub, scrape and compile a social media database, or automatically generate word documents, slide presentations, and more! There are practically endless ways to use functional programming in R that have nothing to do with statistics at all.\nIf you’re a beginner, learning R can be a daunting task. Keep at it! And never hesitate to ask questions.\nRStudio\nWe strongly recommend running R within RStudio, an integrated development environment (IDE) designed to make your experience with R much easier. Some of the reasons we use it, ourselves:\nIncludes a multi-pane window that puts your R console, source code, output, and help files all in one place\nSyntax highlighting and code completion\nSupport for R Projects, a crucial approach to organizing your work and sharing it with others\nIncludes RMarkdown, an R package that allows you write text-based documents with embedded snippets of code that can be passed directly to your R console\nComing soon: tools like the command palette, an improved package manager, and integrated citation management\nLike R, it is available at no cost for users on Windows, Mac, and Linux\n\nThis blog is, itself, an R Project with an individual R Markdown file for each page on the site. Look for a download button at the top of every post: you can download the original R Markdown file, open it in RStudio, and run all of the included code.\nR packages\nAn R package is a collection of functions created by other R users that you can download and install for yourself. Packages can be distributed in many ways, but all of the packages we highlight on this blog can be downloaded from CRAN (the same resource used to download “base” R). A package like ipumsr can be downloaded from CRAN by typing the following function into the R console:\n\nThis function saves package files in your default “library” location. If you’re using a Linux machine and don’t have root access, you’ll need to set up R to save packages to a location where you’re able to write files.\n\n\ninstall.packages(\"ipumsr\")\n\n\n\nPackages also come with help files detailing the purpose and possible inputs (or “arguments”) of each included function. Other included metadata explains what version of R you’ll need to use the package, and also whether the package borrows functions from any other packages that should also be installed (usually these are called “dependencies”).\nIn order to access the functions and help files for a package, you need to load it after installation with:\n\n\nlibrary(ipumsr)\n\n\n\nOn this blog, we will often show functions together with their package like this:\n\n\nipumsr::read_ipums_micro(\n  ddi = \"~/Downloads/pma_00001.xml\",\n  data_file = \"~/Downloads/pma_00001.dat.gz\"\n)\n\n\n\nThe function read_ipums_micro comes from the package ipumsr. It is not necessary for you to include the package each time you call a function (as long as you’ve already loaded the package with library()); we’re using this notation simply as a reminder (in case you want to consult the original package documentation).\n\nYou can use the package::function() notation if you ever want to access a function from a package without loading everything else in the package.\nEssentials\nHere are the packages you’ll need to install to reproduce the code on this blog:\nipumsr\nThe ipumsr package contains functions that make it easy to load IPUMS PMS data into R (mainly read_ipums_micro).\nIt also contains functions that will return variable metadata (like the variable descriptions you see while browsing for data on pma.ipums.org.\ntidyverse\nThe tidyverse package actually installs a family of related packages, including:\nggplot2, for data visualization\ndplyr, for data manipulation\ntidyr, for data tidying\nreadr, for data import\npurrr, for functional programming\ntibble, for tibbles (a modern re-imagining of data frames)\nstringr, for strings\nforcats, for factors\nThis blog uses tidyverse functions and syntax wherever possible because so-called “tidy” conventions are designed with the expressed purpose of making code and console output more human readable. Sometimes, human readability imposes a performance cost: in our experience, IPUMS PMA datasets are small enough that this is not an issue.\n\nFor larger datasets, we recommend exploring the package data.table.\nshiny\nInteractive graphics shown throughout this blog are built with the shiny package.\nWatch for updates here\nWe may add more package suggestions for future posts!\n\n\n\n",
    "preview": "posts/2020-12-10-get-r-and-packages/images/Rlogo.png",
    "last_modified": "2020-12-18T15:46:02-06:00",
    "input_file": {},
    "preview_width": 724,
    "preview_height": 561
  }
]
